Revit 2027 API
BuiltInFailures.EnergyAnalysisFailures.PlenumWithNoCeilingWarn Property
 [Room] has Space Type set to Plenum but has no ceiling surface. A plenum must be separated from the space it serves by a ceiling.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId PlenumWithNoCeilingWarn { get; }
Public Shared ReadOnly Property PlenumWithNoCeilingWarn As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ PlenumWithNoCeilingWarn {
	FailureDefinitionId^ get ();
}
static member PlenumWithNoCeilingWarn : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.EnergyAnalysisFailures Class
Autodesk.Revit.DB Namespace